<a href="https://colab.research.google.com/github/PythonFUA/Introducci-n-al-Machine-Learning/blob/main/Introducci%C3%B3n_a_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



<p><img alt="logo.fua" height="150px" src='https://drive.google.com/uc?export=view&id=1s0UktWjCsp8F6Q6EmCjfofwVYH_1tWVE' align="left" hspace="10px" vspace="5px"></p>




<h1><center><font size="6px"> <strong>INTRODUCCIÓN A PANDAS </font> </strong></center></h1>

#<center> <font size="4.5" >**FACULTAD DE CIENCIAS Y HUMANIDADES**<center>

# **Instalación de módulos**

Para instalar el módulo, todo lo que necesita es:

In [ ]:
#!pip install pandas

Para actualizarlo a la versión más actualizada:

In [ ]:
#!pip install --upgrade pandas

Si quieres instalar una versión específica

In [ ]:
#!pip install pandas==0.9.0

# **Importación de módulos**

In [ ]:
import pandas as pd
import numpy as np

# **Dataset**

Vamos a trabajar con el famoso [Titanic dataset](https://www.kaggle.com/c/titanic/data). Estos son los campos disponibles:

---
- `passengerId`: Un ID numérico asignado a cada pasajero
- `survived`: Si el pasajero sobrevivió (1), o no (0)
- `pclass`: La clase en la que estaba el pasajero
- `nombre`: el nombre del pasajero
- `Sex`: El género del pasajero - hombre o mujer
- `Age`: La edad del pasajero (incluye valores fraccionarios)
- `Sibsp`: El número de hermanos y cónyuges que el pasajero tenía a bordo
- `Parch`: El número de padres e hijos que el pasajero tenía a bordo
- `Ticket`: El número de billete del pasajero
- `Tarifa`: Cuánto pagó el pasajero por el billete
- `Cabin`: La cabina en la que estaba el pasajero
- `Embark`: Donde el pasajero embarcó en el Titanic

---

# **Importar datos desde una url**

Ruta de enlace desde el drive:

https://drive.google.com/file/d/1ZLtB26KdWOAGeHw3CP-Dzi43tibZIOmG/view?usp=sharing


Se copia solamente el Id, esto es:



https://drive.google.com/uc?id=1ZLtB26KdWOAGeHw3CP-Dzi43tibZIOmG

In [ ]:
#url= "https://drive.google.com/uc?id=1ZLtB26KdWOAGeHw3CP-Dzi43tibZIOmG"
#titanic=pd.read_csv(url) #Para leer archivos en formatos xlsx, usamos pd.read_excel
#titanic.tail(2)

# **Importar archivos desde el drive:**

Autorización de acceso a Colab

In [ ]:
from google.colab import drive
drive.mount('/gdrive')
%cd /gdrive

Mounted at /gdrive
/gdrive

In [ ]:
#Ingresamos la ruta de acceso a los datos
titanic = pd.read_csv("/gdrive/MyDrive/Colab Notebooks/INTRODUCCIÓN AL MACHINE LEARNING/titanic.csv")
titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]


<center>





<img src="https://drive.google.com/uc?id=1xUtKXEOFO0BZRYJvE8v-5zraAGMX11uu" width="300px" height="150">
</center>

## Introducción a pandas
`pandas` es un paquete construido sobre `numpy`. El objeto principal de este paquete es el **DataFrame**, que son conjuntos de datos multidimensionales con etiquetas de fila y columna. Además de ofrecer una interfaz para datos etiquetados, pandas también tiene potentes funciones de manipulación de datos.


Las principales características de esta librería son:

- Define nuevas estructuras de datos basadas en los arrays de la librería NumPy pero con nuevas funcionalidades.
- Permite leer y escribir fácilmente ficheros en formato CSV, Excel y bases de datos SQL.
- Permite acceder a los datos mediante índices o nombres para filas y columnas.
- Ofrece métodos para reordenar, dividir y combinar conjuntos de datos.

- Realiza todas estas operaciones de manera muy eficiente.
- Tipos de datos de Pandas
- Pandas dispone de tres estructuras de datos diferentes:

    + Series: Estructura de una dimensión.
    + DataFrame: Estructura de dos dimensiones (tablas).
    + Panel: Estructura de tres dimensiones (cubos).
Estas estructuras se construyen a partir de arrays de la librería NumPy, añadiendo nuevas funcionalidades

In [ ]:
# Nombre de las columnas en el dataset
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# Tipos de datos y cantidad de valores nulos en el conjunto de datos
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
#Otra forma de ver los valores nulos por columna
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#Otra forma de ver el tipo de datos
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
#ver las primeras dos filas
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#ver las últimas dos filas
titanic.tail(2)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[2 rows x 12 columns]

In [ ]:
#tamaño del Dataframe (filas, columnas)
titanic.shape

(891, 12)

In [ ]:
#Nombre de las columnas
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# Información sobre las columnas numéricas
titanic.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
#Valores únicos por columna excluyendo los nulos
titanic.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [ ]:
# Valores únicos por columna, incluidos los nulos
titanic.nunique(dropna=False)

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          148
Embarked         4
dtype: int64

In [ ]:
# Counting
titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
#Información sobre las columnas categoricas 
titanic.describe(include = object)

                          Name   Sex  Ticket Cabin Embarked
count                      891   891     891   204      889
unique                     891     2     681   147        3
top     Sutehall, Mr. Henry Jr  male  347082    G6        S
freq                         1   577       7     4      644

In [ ]:
# Valores únicos de la columna "Embarcado''
titanic['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
# Número de registros que tenemos por categoría de la columna 'Embarcado' sin valores nulos
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
# Número de registros que tenemos por categoría de la columna 'Embarcado' con valores nulos
titanic['Embarked'].value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

# **Cambiar el nombre de las columnas**

In [ ]:
titanic.columns = ['Passenger_Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
titanic = titanic.rename(columns={'Passenger_Id':'Passenger_Id'})
titanic.head()

   Passenger_Id  Survived  Pclass  ...     Fare Cabin  Embarked
0             1         0       3  ...   7.2500   NaN         S
1             2         1       1  ...  71.2833   C85         C
2             3         1       3  ...   7.9250   NaN         S
3             4         1       1  ...  53.1000  C123         S
4             5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#filtros
titanic[(titanic['Embarked']=='S') & (titanic['Sex']=='female')][['Name','Age']].head(3)

                                                Name   Age
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0

In [ ]:
#Ordenar columnas de manera ascedente o descendente
titanic.sort_values("Age",ascending=False)

     Passenger_Id  Survived  Pclass  ...     Fare Cabin  Embarked
630           631         1       1  ...  30.0000   A23         S
851           852         0       3  ...   7.7750   NaN         S
493           494         0       1  ...  49.5042   NaN         C
96             97         0       1  ...  34.6542    A5         C
116           117         0       3  ...   7.7500   NaN         Q
..            ...       ...     ...  ...      ...   ...       ...
859           860         0       3  ...   7.2292   NaN         C
863           864         0       3  ...  69.5500   NaN         S
868           869         0       3  ...   9.5000   NaN         S
878           879         0       3  ...   7.8958   NaN         S
888           889         0       3  ...  23.4500   NaN         S

[891 rows x 12 columns]

In [ ]:
#Ordene titanic primero por edad (ascendente) y luego por clase (descendente)
titanic.sort_values(['Age', 'Pclass' ], ascending=[True, False])

     Passenger_Id  Survived  Pclass  ...     Fare Cabin  Embarked
803           804         1       3  ...   8.5167   NaN         C
755           756         1       2  ...  14.5000   NaN         S
469           470         1       3  ...  19.2583   NaN         C
644           645         1       3  ...  19.2583   NaN         C
78             79         1       2  ...  29.0000   NaN         S
..            ...       ...     ...  ...      ...   ...       ...
766           767         0       1  ...  39.6000   NaN         C
793           794         0       1  ...  30.6958   NaN         C
815           816         0       1  ...   0.0000  B102         S
839           840         1       1  ...  29.7000   C47         C
849           850         1       1  ...  89.1042   C92         C

[891 rows x 12 columns]

In [ ]:
#para selecionar una columna
titanic["Pclass"]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [ ]:
#para seleccionar varias columnas
titanic[["Sex","Age"]]

        Sex   Age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

# **Filtros**

In [ ]:
#pasajeros que tienen más de 60 años
edad_adultos = titanic[titanic['Age']>60]
edad_adultos

     Passenger_Id  Survived  Pclass  ...      Fare        Cabin  Embarked
33             34         0       2  ...   10.5000          NaN         S
54             55         0       1  ...   61.9792          B30         C
96             97         0       1  ...   34.6542           A5         C
116           117         0       3  ...    7.7500          NaN         Q
170           171         0       1  ...   33.5000          B19         S
252           253         0       1  ...   26.5500          C87         S
275           276         1       1  ...   77.9583           D7         S
280           281         0       3  ...    7.7500          NaN         Q
326           327         0       3  ...    6.2375          NaN         S
438           439         0       1  ...  263.0000  C23 C25 C27         S
456           457         0       1  ...   26.5500          E38         S
483           484         1       3  ...    9.5875          NaN         S
493           494         0       1  ...   49.5042          NaN         C
545           546         0       1  ...   26.0000          NaN         S
555           556         0       1  ...   26.5500          NaN         S
570           571         1       2  ...   10.5000          NaN         S
625           626         0       1  ...   32.3208          D50         S
630           631         1       1  ...   30.0000          A23         S
672           673         0       2  ...   10.5000          NaN         S
745           746         0       1  ...   71.0000          B22         S
829           830         1       1  ...   80.0000          B28       NaN
851           852         0       3  ...    7.7750          NaN         S

[22 rows x 12 columns]

In [ ]:
#pasajeros que tienen más de 60 años y viajan en primera clase
titanic[(titanic['Age']>60) & (titanic['Pclass']==1)]    #podemos usar .shape para determinar el tamaño

     Passenger_Id  Survived  Pclass  ...      Fare        Cabin  Embarked
54             55         0       1  ...   61.9792          B30         C
96             97         0       1  ...   34.6542           A5         C
170           171         0       1  ...   33.5000          B19         S
252           253         0       1  ...   26.5500          C87         S
275           276         1       1  ...   77.9583           D7         S
438           439         0       1  ...  263.0000  C23 C25 C27         S
456           457         0       1  ...   26.5500          E38         S
493           494         0       1  ...   49.5042          NaN         C
545           546         0       1  ...   26.0000          NaN         S
555           556         0       1  ...   26.5500          NaN         S
625           626         0       1  ...   32.3208          D50         S
630           631         1       1  ...   30.0000          A23         S
745           746         0       1  ...   71.0000          B22         S
829           830         1       1  ...   80.0000          B28       NaN

[14 rows x 12 columns]

In [ ]:
#para seleccionar fila 10 a 15 y desde la columna PassengerId hasta la columna Age
titanic.loc[10:15,'Passenger_Id':'Age']

    Passenger_Id  Survived  ...     Sex   Age
10            11         1  ...  female   4.0
11            12         1  ...  female  58.0
12            13         0  ...    male  20.0
13            14         0  ...    male  39.0
14            15         0  ...  female  14.0
15            16         1  ...  female  55.0

[6 rows x 6 columns]

In [ ]:
#para seleccionar fila 10 a 15 y desde la columna PassengerId hasta la columna Age
titanic.iloc[10:15,0:5]

    Passenger_Id  Survived  ...                                  Name     Sex
10            11         1  ...       Sandstrom, Miss. Marguerite Rut  female
11            12         1  ...              Bonnell, Miss. Elizabeth  female
12            13         0  ...        Saundercock, Mr. William Henry    male
13            14         0  ...           Andersson, Mr. Anders Johan    male
14            15         0  ...  Vestrom, Miss. Hulda Amanda Adolfina  female

[5 rows x 5 columns]

In [ ]:
#para seleccionar solamente filas
titanic[50:55]

    Passenger_Id  Survived  Pclass  ...     Fare Cabin  Embarked
50            51         0       3  ...  39.6875   NaN         S
51            52         0       3  ...   7.8000   NaN         S
52            53         1       1  ...  76.7292   D33         C
53            54         1       2  ...  26.0000   NaN         S
54            55         0       1  ...  61.9792   B30         C

[5 rows x 12 columns]

In [ ]:
#aplicamos filtro y selecionamos cierto rango de filas
titanic[(titanic['Age'] > 18) & (titanic['Age'] < 50) & (titanic['Sex']=='female')][10:20]

     Passenger_Id  Survived  Pclass  ...      Fare        Cabin  Embarked
53             54         1       2  ...   26.0000          NaN         S
56             57         1       2  ...   10.5000          NaN         S
61             62         1       1  ...   80.0000          B28       NaN
66             67         1       2  ...   10.5000          F33         S
79             80         1       3  ...   12.4750          NaN         S
85             86         1       3  ...   15.8500          NaN         S
88             89         1       1  ...  263.0000  C23 C25 C27         S
98             99         1       2  ...   23.0000          NaN         S
100           101         0       3  ...    7.8958          NaN         S
106           107         1       3  ...    7.6500          NaN         S

[10 rows x 12 columns]

In [ ]:
titanic[(titanic["Pclass"]==1) | (titanic["Survived"]==0)]
titanic.Cabin

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [ ]:
#media de las edades
titanic['Age'].mean()

29.69911764705882

# **Agrupación**

In [ ]:
#agrupar por sex
titanic.groupby('Sex').size()

Sex
female    314
male      577
dtype: int64

In [ ]:
#agrupas y aplicar funciones
titanic.groupby('Sex').agg({'Age':['min','mean','max']})

         Age
         min       mean   max
Sex
female  0.75  27.915709  63.0
male    0.42  30.726645  80.0

In [ ]:
titanic.groupby(['Sex','Survived']).agg({'Fare':'count','Age':'mean'}).reset_index()

      Sex  Survived  Fare        Age
0  female         0    81  25.046875
1  female         1   233  28.847716
2    male         0   468  31.618056
3    male         1   109  27.276022

In [ ]:
titanic.describe(include=object)

                          Name   Sex  Ticket Cabin Embarked
count                      891   891     891   204      889
unique                     891     2     681   147        3
top     Sutehall, Mr. Henry Jr  male  347082    G6        S
freq                         1   577       7     4      644

### `crosstab()`

La función pandas.crosstab devuelve la tabla de contingencia resultante de cruzar dos o más campos de un dataframe.

In [ ]:
pd.crosstab(titanic['Sex'], titanic['Pclass'])

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

## **Tablas dinámicas**

Son como las tablas dinámicas de Excel. Aquí la utilizamos para ver la edad media de los pasajeros, segregada por clase y género:

In [ ]:
titanic.pivot_table(values='Age',index='Sex',columns='Pclass', aggfunc=np.mean)

Pclass          1          2          3
Sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

En el conjunto de datos una primera pregunta puede ser cuál es el porcentaje de los pasajeros en función de su clase.

In [ ]:
titanic.pivot_table('Survived', 'Pclass')

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [ ]:
# El resultado anterior muestra los porcentajes de supervivencia por clase, pero puede que sea más interesante 
#obtener el total.
titanic.pivot_table('Survived', 'Pclass',aggfunc=np.sum)

        Survived
Pclass
1            136
2             87
3            119

In [ ]:
titanic.columns

Index(['Passenger_Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
titanic.pivot_table('Survived', ['Sex', 'Parch'], 'Pclass',aggfunc=np.sum)

Pclass           1     2     3
Sex    Parch
female 0      63.0  40.0  50.0
       1      17.0  17.0  12.0
       2      11.0  11.0   8.0
       3       NaN   2.0   1.0
       4       NaN   NaN   0.0
       5       NaN   NaN   1.0
       6       NaN   NaN   0.0
male   0      36.0   8.0  36.0
       1       4.0   7.0   8.0
       2       5.0   2.0   3.0
       3       NaN   NaN   0.0
       4       0.0   NaN   0.0
       5       NaN   NaN   0.0

# **Validar datos duplicados**

In [ ]:
df_tickets = titanic.groupby('Ticket').size().reset_index().rename(columns={0:'count'})
df_tickets

          Ticket  count
0         110152      3
1         110413      3
2         110465      2
3         110564      1
4         110813      1
..           ...    ...
676   W./C. 6608      4
677   W./C. 6609      1
678  W.E.P. 5734      1
679    W/C 14208      1
680    WE/P 5735      2

[681 rows x 2 columns]

In [ ]:
df_tickets.sort_values(by='count',ascending=False)

       Ticket  count
80       1601      7
568  CA. 2343      7
333    347082      7
566   CA 2144      6
337    347088      6
..        ...    ...
300    345572      1
299    345364      1
298    343276      1
297    343275      1
340    347464      1

[681 rows x 2 columns]

In [ ]:
titanic[titanic['Ticket']=='347082']

     Passenger_Id  Survived  Pclass  ...    Fare Cabin  Embarked
13             14         0       3  ...  31.275   NaN         S
119           120         0       3  ...  31.275   NaN         S
541           542         0       3  ...  31.275   NaN         S
542           543         0       3  ...  31.275   NaN         S
610           611         0       3  ...  31.275   NaN         S
813           814         0       3  ...  31.275   NaN         S
850           851         0       3  ...  31.275   NaN         S

[7 rows x 12 columns]

### **Ejercicio 1:**

Utilizando las columnas `"sexo"`, `"edad"` y `"tarifa"`, responde a las siguientes preguntas:

1. ¿Cuántos hombres y mujeres tenemos en nuestro conjunto de datos?
2. ¿Cuál es la edad más frecuente en nuestro conjunto de datos?
3. ¿Cuál es la edad más frecuente en las mujeres?
4. ¿Cuál es la edad más frecuente para los hombres?
5. ¿Cuál es el precio más común del billete?
6. ¿Es el precio del billete más común el mismo para hombres y mujeres?

# Pre-procesamiento de nuestros datos

Ahora que tenemos una idea de en qué consiste nuestro conjunto de datos, vamos a transformarlo para poder visualizar la fase. Los tipos de actividades que podemos realizar durante el **preprocesamiento** incluyen

1. **Eliminar columnas**
2. **Enriquecer (o transformar)** un conjunto de datos, añadiendo nuevas columnas calculadas en los índices
3. **Filtrar** un subconjunto de filas o columnas de un conjunto de datos según algún criterio
4. **Indexar** un conjunto de datos
5. **Agregar** datos
6. **Ordenar** las filas de un conjunto de datos según algún criterio
7. **Fusionar** los datos
8. **Pivotear** de forma que los datos que originalmente estaban dispuestos en vertical se dispongan en horizontal (aumentando el número de columnas) o viceversa (aumentando el número de filas)

entre otros.

In [ ]:
titanic.columns

Index(['Passenger_Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## **drop()**

El método .drop() asociado a un dataframe pandas devuelve una copia del mismo tras eliminar las filas o columnas indicadas. Por defecto se eliminan filas y se devuelve una copia del dataframe tras realizar la eliminación:

In [ ]:
titanic.drop(['Passenger_Id','Name','Cabin'],axis=1, inplace=True)
titanic.shape

(891, 9)

In [ ]:
#titanic.drop(columns = ["Name", "smoker"]).head()

In [ ]:
# Validación nula de nuevo
titanic.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      2
dtype: int64

In [ ]:
titanic.head(20)

    Survived  Pclass     Sex   Age  ...  Parch            Ticket     Fare  Embarked
0          0       3    male  22.0  ...      0         A/5 21171   7.2500         S
1          1       1  female  38.0  ...      0          PC 17599  71.2833         C
2          1       3  female  26.0  ...      0  STON/O2. 3101282   7.9250         S
3          1       1  female  35.0  ...      0            113803  53.1000         S
4          0       3    male  35.0  ...      0            373450   8.0500         S
5          0       3    male   NaN  ...      0            330877   8.4583         Q
6          0       1    male  54.0  ...      0             17463  51.8625         S
7          0       3    male   2.0  ...      1            349909  21.0750         S
8          1       3  female  27.0  ...      2            347742  11.1333         S
9          1       2  female  14.0  ...      0            237736  30.0708         C
10         1       3  female   4.0  ...      1           PP 9549  16.7000         S
11         1       1  female  58.0  ...      0            113783  26.5500         S
12         0       3    male  20.0  ...      0         A/5. 2151   8.0500         S
13         0       3    male  39.0  ...      5            347082  31.2750         S
14         0       3  female  14.0  ...      0            350406   7.8542         S
15         1       2  female  55.0  ...      0            248706  16.0000         S
16         0       3    male   2.0  ...      1            382652  29.1250         Q
17         1       2    male   NaN  ...      0            244373  13.0000         S
18         0       3  female  31.0  ...      0            345763  18.0000         S
19         1       3  female   NaN  ...      0              2649   7.2250         C

[20 rows x 9 columns]

# **valores nulos**

Dependiendo del problema, el tratamiento de los nulos puede ser manejado de diferentes maneras:

* Mantenerlos
* Borrarlos
* Dejar un valor fijo que los diferencie
* Sustituirlos por un estadístico de resumen (media, mediana, moda)
* Rellenar hacia delante o hacia atrás
* Interpolar

In [ ]:
# borrarlos
titanic.dropna(inplace=True)
titanic.shape

(712, 9)

In [ ]:
# Validación nulos
titanic.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64



La función Python Pandas `DataFrame.reset_index()` restablece el índice del DataFrame dado.

In [ ]:
titanic.reset_index(drop=True,inplace=True)
titanic.head(10)

   Survived  Pclass     Sex   Age  ...  Parch            Ticket     Fare  Embarked
0         0       3    male  22.0  ...      0         A/5 21171   7.2500         S
1         1       1  female  38.0  ...      0          PC 17599  71.2833         C
2         1       3  female  26.0  ...      0  STON/O2. 3101282   7.9250         S
3         1       1  female  35.0  ...      0            113803  53.1000         S
4         0       3    male  35.0  ...      0            373450   8.0500         S
5         0       1    male  54.0  ...      0             17463  51.8625         S
6         0       3    male   2.0  ...      1            349909  21.0750         S
7         1       3  female  27.0  ...      2            347742  11.1333         S
8         1       2  female  14.0  ...      0            237736  30.0708         C
9         1       3  female   4.0  ...      1           PP 9549  16.7000         S

[10 rows x 9 columns]

In [ ]:
url= "https://drive.google.com/uc?id=1ZLtB26KdWOAGeHw3CP-Dzi43tibZIOmG"
titanic=pd.read_csv(url) #Para leer archivos en formatos xlsx, usamos pd.read_excel
titanic.drop(['PassengerId','Name','Cabin'],axis=1, inplace=True)
titanic.head(10)

   Survived  Pclass     Sex   Age  ...  Parch            Ticket     Fare  Embarked
0         0       3    male  22.0  ...      0         A/5 21171   7.2500         S
1         1       1  female  38.0  ...      0          PC 17599  71.2833         C
2         1       3  female  26.0  ...      0  STON/O2. 3101282   7.9250         S
3         1       1  female  35.0  ...      0            113803  53.1000         S
4         0       3    male  35.0  ...      0            373450   8.0500         S
5         0       3    male   NaN  ...      0            330877   8.4583         Q
6         0       1    male  54.0  ...      0             17463  51.8625         S
7         0       3    male   2.0  ...      1            349909  21.0750         S
8         1       3  female  27.0  ...      2            347742  11.1333         S
9         1       2  female  14.0  ...      0            237736  30.0708         C

[10 rows x 9 columns]

In [ ]:
titanic["Age"].mode()

0    24.0
dtype: float64

In [ ]:
titanic.fillna(titanic['Age'].mean()).head(10)

   Survived  Pclass     Sex  ...            Ticket     Fare  Embarked
0         0       3    male  ...         A/5 21171   7.2500         S
1         1       1  female  ...          PC 17599  71.2833         C
2         1       3  female  ...  STON/O2. 3101282   7.9250         S
3         1       1  female  ...            113803  53.1000         S
4         0       3    male  ...            373450   8.0500         S
5         0       3    male  ...            330877   8.4583         Q
6         0       1    male  ...             17463  51.8625         S
7         0       3    male  ...            349909  21.0750         S
8         1       3  female  ...            347742  11.1333         S
9         1       2  female  ...            237736  30.0708         C

[10 rows x 9 columns]

In [ ]:
titanic['Age'].fillna(titanic['Age'].median()).head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
titanic['Age'].fillna(titanic['Age'].mode()[0]).head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    24.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
#rellena todos los valores NaN de DataFrame con el valor después del valor NaN en la misma columna.
titanic['Age'].fillna(method='backfill').head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    54.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
# rellena todos los valores NaN de DataFrame con el valor anterior al valor NaN en la misma columna.
titanic['Age'].fillna(method='ffill').head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    35.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
titanic.interpolate(method='polynomial', order=2).head(10)

   Survived  Pclass     Sex  ...            Ticket     Fare  Embarked
0         0       3    male  ...         A/5 21171   7.2500         S
1         1       1  female  ...          PC 17599  71.2833         C
2         1       3  female  ...  STON/O2. 3101282   7.9250         S
3         1       1  female  ...            113803  53.1000         S
4         0       3    male  ...            373450   8.0500         S
5         0       3    male  ...            330877   8.4583         Q
6         0       1    male  ...             17463  51.8625         S
7         0       3    male  ...            349909  21.0750         S
8         1       3  female  ...            347742  11.1333         S
9         1       2  female  ...            237736  30.0708         C

[10 rows x 9 columns]

# Codificación de variables categóricas

A veces, es útil crear una columna para cada categoría posible de una de nuestras variables categóricas. Para ello, utilizamos un método `pandas` llamado `get_dummies()`:

In [ ]:
titanic['sexDummies'] = titanic['Sex']
titanic

     Survived  Pclass     Sex  ...     Fare  Embarked  sexDummies
0           0       3    male  ...   7.2500         S        male
1           1       1  female  ...  71.2833         C      female
2           1       3  female  ...   7.9250         S      female
3           1       1  female  ...  53.1000         S      female
4           0       3    male  ...   8.0500         S        male
..        ...     ...     ...  ...      ...       ...         ...
886         0       2    male  ...  13.0000         S        male
887         1       1  female  ...  30.0000         S      female
888         0       3  female  ...  23.4500         S      female
889         1       1    male  ...  30.0000         C        male
890         0       3    male  ...   7.7500         Q        male

[891 rows x 10 columns]

# **Método pandas.get_dummies()**

In [ ]:
#Establezca prefix para cambiar el nombre por defecto de las columnas ficticias
titanic = pd.get_dummies(titanic, columns = ['sexDummies'], prefix = ['D'])
titanic.head()

   Survived  Pclass     Sex   Age  ...     Fare  Embarked D_female  D_male
0         0       3    male  22.0  ...   7.2500         S        0       1
1         1       1  female  38.0  ...  71.2833         C        1       0
2         1       3  female  26.0  ...   7.9250         S        1       0
3         1       1  female  35.0  ...  53.1000         S        1       0
4         0       3    male  35.0  ...   8.0500         S        0       1

[5 rows x 11 columns]

## **Ejercicio 2:**

1. Agrupa el conjunto de datos por género (`sexo`) y calcula la edad media (`edad`).
2. Agrupar el conjunto de datos por la columna familia (`familia`) y contar el número de registros por grupo.
3. De las familias, ¿cuántas sobrevivieron y cuántas no?

In [ ]:
 x = "7.6  5.4.  7.8"